clear;clc;

A = xlsread("动力学参数估计.xlsx",1, 'D2:F55');
M = xlsread("动力学参数估计.xlsx",1, 'G2:G55');
A = sin(A);

g = 9.81;
m1 = 3.119;
m2 = 11.5411;
m3 = 12.610075;
l1 = 0.35;
l2 = 0.35;
l3 = 0.429;

X = 1/g*inv(A'*A)*A'*M;
err = A*X -1/9.81*M;
max(err)

d3 = X(3)/m3;
d2 = (X(2)-m3*l2)/m2;
d1 = (X(1)-m3*l1-m2*l1)/m1;

I1 = m1*l1^2/12;
I2 = m2*l2^2/12;
I3 = m3*l3^2/12;

a(1) = I1 + m1*d1^2 + (m2+m3)*l1^2;
a(2) = I2 + m2*d2^2 + m3*l2^2;
a(3) = I3 + m3*d3^2;
a(4) = m2*l1*d2 + m3*l1*l2;
a(5) = m3*l1*d3;
a(6) = m3*l2*d3;
a(7) = (m1*d1 + m2*l1 + m3*l1)*g;
a(8) = (m2*d2 + m3*l2)*g;
a(9) = m3*d3*g;